## Types Of Missing Data

I- MAR(MIssing at random)

II- MCAR(Missing completely at random)

III- MNAR(Missing not at random)

## MAR(MIssing at random)

In MAR, the probability of missing values with respect to various features will be same in the whole dataset.

## MCAR(Missing completely at random)

In MCAR, there exists no relationship between the data missing and any other values, obsereved or missing within the dataset.

## MNAR(Missing not at random)

In MCAR, there exists some relationship between the data missing and any other values, obsereved or missing within the dataset.

## Techniques For Handling Missing Values

I)Mean/Median/Mode replacement

II)Random sample imputations 

III)Capturing NaN values with new features

IV)End of distribution

V)Arbitrary imputations

VI)Frequent categories imputations

## Implementating On Dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("titanic.csv")
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### MCAR

In [4]:
df[df["Embarked"].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

#### MNAR

In [5]:
df["Cabin"].isnull().sum()

687

In [6]:
df["Cabin_null"]=np.where(df["Cabin"].isnull(),1,0)

In [7]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_null
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [8]:
df["Cabin_null"].mean()

0.7710437710437711

In [9]:
df.groupby(['Survived'])['Cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: Cabin_null, dtype: float64

### Mean/Median/Mode replacement

In [10]:
df=pd.read_csv('titanic.csv',usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [11]:
df.isnull().sum()

Survived      0
Age         177
Fare          0
dtype: int64

In [12]:
df.isnull().mean()

Survived    0.000000
Age         0.198653
Fare        0.000000
dtype: float64

In [13]:
def impute_nan(df,variable,median):
    df[variable + "_median"]=df[variable].fillna(median)

In [14]:
median=df.Age.median()
median

28.0

In [15]:
impute_nan(df,"Age",median)
df.head(5)

   Survived   Age     Fare  Age_median
0         0  22.0   7.2500        22.0
1         1  38.0  71.2833        38.0
2         1  26.0   7.9250        26.0
3         1  35.0  53.1000        35.0
4         0  35.0   8.0500        35.0

##### Advantages

Easy to implement(Robust to outliers)

Faster way to obtain the complete dataset

##### Disadvantages

Change or Distortion in the original variance

Impacts Correlation

### Random sample imputations

In [16]:
df=pd.read_csv("titanic.csv",usecols=["Age","Fare","Survived"])
df.head(5)

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [17]:
df.isnull().sum()

Survived      0
Age         177
Fare          0
dtype: int64

In [18]:
def impute_nan(df,variable,median):
    df[variable+"_random"]=df[variable]
    random_sample=df[variable].dropna().sample(df[variable].isnull().sum(),random_state=0)
    random_sample.index=df[df[variable].isnull()].index
    df.loc[df[variable].isnull(),variable+'_random']=random_sample

In [19]:
median=df.Age.median()

In [20]:
median

28.0

In [21]:
impute_nan(df,"Age",median)
df.head(5)

   Survived   Age     Fare  Age_random
0         0  22.0   7.2500        22.0
1         1  38.0  71.2833        38.0
2         1  26.0   7.9250        26.0
3         1  35.0  53.1000        35.0
4         0  35.0   8.0500        35.0

##### Advantages

Easy To implement

There is less distortion in variance

##### Disadvantages

Every situation randomness wont work

### Capturing NaN values with new features

In [22]:
df=pd.read_csv('titanic.csv', usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [23]:
df["Age_nan"]=np.where(df["Age"].isnull(),1,0)

In [24]:
df.head(10)

   Survived   Age     Fare  Age_nan
0         0  22.0   7.2500        0
1         1  38.0  71.2833        0
2         1  26.0   7.9250        0
3         1  35.0  53.1000        0
4         0  35.0   8.0500        0
5         0   NaN   8.4583        1
6         0  54.0  51.8625        0
7         0   2.0  21.0750        0
8         1  27.0  11.1333        0
9         1  14.0  30.0708        0

##### Advantages

Easy to implement

Captures the importance of missing values

##### Disadvantages

Creating Additional Features(Curse of Dimensionality)

### End of distribution

In [25]:
df=pd.read_csv('titanic.csv', usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [26]:
extreme=df.Age.mean()+3*df.Age.std()
extreme

73.27860964406095

In [27]:
def impute_nan(df,variable,median,extreme):
    df[variable+"_end_distribution"]=df[variable].fillna(extreme)
    df[variable].fillna(median,inplace=True)

In [28]:
impute_nan(df,'Age',df.Age.median(),extreme)

In [29]:
df.head()

   Survived   Age     Fare  Age_end_distribution
0         0  22.0   7.2500                  22.0
1         1  38.0  71.2833                  38.0
2         1  26.0   7.9250                  26.0
3         1  35.0  53.1000                  35.0
4         0  35.0   8.0500                  35.0

##### Advantages

Easy to implement

Capture the importance of missingness if there is one

##### Disadvantages

Distorts the original distribution of the variable.

If number of Nan is big, true outliers in the distribution.

If number of Nan is small, the replaced Nan will be considered as outliers.

### Arbitrary imputations

In [30]:
df=pd.read_csv("titanic.csv", usecols=["Age","Fare","Survived"])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [31]:
def impute_nan(df,variable):
    df[variable+'_zero']=df[variable].fillna(0)
    df[variable+'_hundred']=df[variable].fillna(100)

In [32]:
impute_nan(df,"Age")

In [33]:
df.head(5)

   Survived   Age     Fare  Age_zero  Age_hundred
0         0  22.0   7.2500      22.0         22.0
1         1  38.0  71.2833      38.0         38.0
2         1  26.0   7.9250      26.0         26.0
3         1  35.0  53.1000      35.0         35.0
4         0  35.0   8.0500      35.0         35.0

##### Advantages

Easy to implement

Captures the importance of missingess if there is one

##### Disadvantages

Distorts the original distribution of the variable

If missingess is not important, it may mask the predictive power of the original variable by distorting its distribution

Hard to decide which value to use

### Frequent categories imputations

##### Dealing with missing categorical variables

In [35]:
df=pd.read_csv("house_data.csv")

In [36]:
df.head(5)

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,ScreenPorch,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition
0,1461,20,RH,80.0,11622,Pave,NaN,Reg,Lvl,AllPub,...,120,0,NaN,MnPrv,NaN,0,6,2010,WD,Normal
1,1462,20,RL,81.0,14267,Pave,NaN,IR1,Lvl,AllPub,...,0,0,NaN,NaN,Gar2,12500,6,2010,WD,Normal
2,1463,60,RL,74.0,13830,Pave,NaN,IR1,Lvl,AllPub,...,0,0,NaN,MnPrv,NaN,0,3,2010,WD,Normal
3,1464,60,RL,78.0,9978,Pave,NaN,IR1,Lvl,AllPub,...,0,0,NaN,NaN,NaN,0,6,2010,WD,Normal
4,1465,120,RL,43.0,5005,Pave,NaN,IR1,HLS,AllPub,...,144,0,NaN,NaN,NaN,0,1,2010,WD,Normal

In [37]:
df.columns

Index(['Id', 'MSSubClass', 'MSZoning', 'LotFrontage', 'LotArea', 'Street',
       'Alley', 'LotShape', 'LandContour', 'Utilities', 'LotConfig',
       'LandSlope', 'Neighborhood', 'Condition1', 'Condition2', 'BldgType',
       'HouseStyle', 'OverallQual', 'OverallCond', 'YearBuilt', 'YearRemodAdd',
       'RoofStyle', 'RoofMatl', 'Exterior1st', 'Exterior2nd', 'MasVnrType',
       'MasVnrArea', 'ExterQual', 'ExterCond', 'Foundation', 'BsmtQual',
       'BsmtCond', 'BsmtExposure', 'BsmtFinType1', 'BsmtFinSF1',
       'BsmtFinType2', 'BsmtFinSF2', 'BsmtUnfSF', 'TotalBsmtSF', 'Heating',
       'HeatingQC', 'CentralAir', 'Electrical', '1stFlrSF', '2ndFlrSF',
       'LowQualFinSF', 'GrLivArea', 'BsmtFullBath', 'BsmtHalfBath', 'FullBath',
       'HalfBath', 'BedroomAbvGr', 'KitchenAbvGr', 'KitchenQual',
       'TotRmsAbvGrd', 'Functional', 'Fireplaces', 'FireplaceQu', 'GarageType',
       'GarageYrBlt', 'GarageFinish', 'GarageCars', 'GarageArea', 'GarageQual',
       'GarageCond', 'PavedDrive', 'WoodDeckSF', 'OpenPorchSF',
       'EnclosedPorch', '3SsnPorch', 'ScreenPorch', 'PoolArea', 'PoolQC',
       'Fence', 'MiscFeature', 'MiscVal', 'MoSold', 'YrSold', 'SaleType',
       'SaleCondition'],
      dtype='object')

In [39]:
df=pd.read_csv("house_data.csv",usecols=['BsmtQual','FireplaceQu','GarageType','SaleType'])
df.head(5)

  BsmtQual FireplaceQu GarageType SaleType
0       TA         NaN     Attchd       WD
1       TA         NaN     Attchd       WD
2       Gd          TA     Attchd       WD
3       TA          Gd     Attchd       WD
4       Gd         NaN     Attchd       WD

In [40]:
df.isnull().sum()

BsmtQual        44
FireplaceQu    730
GarageType      76
SaleType         1
dtype: int64

In [41]:
df.isnull().mean().sort_values(ascending=True)

SaleType       0.000685
BsmtQual       0.030158
GarageType     0.052090
FireplaceQu    0.500343
dtype: float64

In [44]:
def impute_nan(df,variable):
    most_frequent_category=df[variable].mode()[0]
    df[variable].fillna(most_frequent_category,inplace=True)

In [47]:
for feature in ['BsmtQual','FireplaceQu','GarageType','SaleType']:
    impute_nan(df,feature)

In [48]:
df.isnull().sum()

BsmtQual       0
FireplaceQu    0
GarageType     0
SaleType       0
dtype: int64

##### Advantages

Easy To implement

Faster way to implement

##### Disadvantages

Since we are using the more frequent labels, it may use them in an over respresented way, if there are many nan's it distorts the relation of the most frequent label